FSI/flap_perp/OpenFOAM-CalculiX_interFoam/Fluid_compressibleInterFoam/constant/turbulenceProperties_orig
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType laminar;

// ************************************************************************* //
