FSI/flap_perp/OpenFOAM-CalculiX_interFoam/Fluid_compressibleInterFoam/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

pMin            pMin [ 1 -1 -2 0 0 0 0 ] 10000;

sigma           sigma [1 0 -2 0 0 0 0] 0.072;

// ************************************************************************* //
