FSI/flap_perp/OpenFOAM-CalculiX_interFoam/Fluid_compressibleInterFoam/0_orig/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    flap
    {
        type            zeroGradient;
    }

    inlet
    {
//         type            fixedValue;
//         value           $internalField;
        type            zeroGradient;
    }
    
    upperWall
    {
        type            zeroGradient;
    }
    
    lowerWall
    {
        type            zeroGradient;
    }
    
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}

// {
//     wall
//     {
//         type            zeroGradient;
//     }
// 
//     inlet
//     {
//         type            zeroGradient;
//     }
//     
//     inlet2
//     {
//         type            zeroGradient;
//     }
//     
//     inlet3
//     {
//         type            zeroGradient;
//     }
//     
//     outlet
//     {
//         type            zeroGradient;
//     }
// }

// ************************************************************************* //
