FSI/flap_perp/OpenFOAM-CalculiX_interFoam/Fluid_compressibleInterFoam/0_orig/T.air
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T.air;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 300;
    }
    outlet
    {
        type            calculated;
        value           uniform 300;
    }
    flap
    {
        type            calculated;
        value           uniform 300;
    }
    upperWall
    {
        type            calculated;
        value           uniform 300;
    }
    lowerWall
    {
        type            calculated;
        value           uniform 300;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
