FSI/flap_perp/OpenFOAM-CalculiX_interFoam/Fluid_compressibleInterFoam/0_orig/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-11;

boundaryField
{

    inlet
    {
        type            fixedValue;
        value           uniform 1e-05;
    }
    
    flap
    {
        type            fixedValue;
        value           uniform 1e-05;
    }
    
    upperWall
    {
        type            fixedValue;
        value           uniform 1e-05;
    }

    lowerWall
    {
        type            fixedValue;
        value           uniform 1e-11;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.001;
        value           uniform 1e-11;
    }
    
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
